# 2026-07-06-01

刚刚开完上午的会，也挺少参加教育系统会议的反正，这次属于很少数的回去列席的其实。听到一段话挺有启发性的发一下吧（包含个人表述）：

我们社会中的工作是很多元化的；即使是在科创领域，我们的社会也需要很多不同的多元的人才，粗略的分可以分为两大类，也就是提出问题的人，和解决问题的人。

我们教育体系培养出来的绝大部分学生，到达一个新的环境擅长先观察规则，然后去学习与适应规则，并取得优异的成绩。这在中等教育阶段就是成绩与分数，当然我们现在也在引进更多元化的评价手段，在高等教育中是更多元化的绩点等，到了工作中或许是KPI或许是其他。培养出这样的学生是成功的，因为我们社会需要大量解决问题的人，在标准下进行改良的人；我们国家一直也以务实为核心，改革开放以来也一直在向国际标准看齐，需要在规则下进行创新与完善。当然，对这一类学生的培养，需要注意的是，教育者在教育的过程中要避免其投机取巧倾向，避免为了追求规则内的最优而走歪门邪路的思想产生，也要树立正确的人生观尽量避免产生精致利己主义倾向。

然而，随着问题是逐步深化，也是我国在科创领域由起步追赶向引领的跨越引来的需求，我们也需要能提出问题的人。这类学生最主要的特点便是，进入一个规则体系先去观察规则并去思考规则为何如此制定，其与实际目标和价值的关联如何，以及我们有没有更好的方法去制定这个规则来达成我们的最本质目的。这一类学生是范式变革的推力，或许不多，因而在教育者教育的过程中要更加悉心去挖掘这样的潜力。对这一类学生的教育，教育者的主要责任便是提供优秀的启发性环境，并时刻警惕发生反社会化倾向或者情感共情能力、社交能力的退化等情况；对规则的刨根问底虽然是范式创新的思维，但同时容易产生虚无感或者引来人生观偏差，这便是教育者的责任。

当然，这两类人在科创领域的创新中都有起到巨大的作用，也都将起到巨大的作用；并不是说只有这两类人，人的个性是各异的，社会的需求也是多元的，我们的教育者也要擅长去发掘每一个孩子的潜力。如果每一个孩子的潜力都被最大程度的发挥出来了，我们实现从追赶到引领，实现中华民族的伟大复兴也必将指日可待。

（只是简记，和原文可能略有出入）

===

# 2026-07-06-02

会后一些和大家闲谈，我的部分发言：

“其实个人觉得最根本的问题还是思想上，我们现在有了西方管理方式与社会科学的壳，但是缺乏了科学精神与理性主义的内核。

近代以来，因为文化变革时间实在太短，又恰逢中国救亡图存之际和当时民众文化率普遍太低，我们的思想变革进行的远没有西方文艺复兴来的深刻。五四运动等思想启蒙也主要停留在了知识分子阶层和城镇，从历史上来看，我国历史上主要人口思想受到的渐进式思想启蒙并不多。而彻底的思想启蒙是需要渐进式数代人的。

至今，不是中高考制度的先进性科学性有问题（很多国家也有类似制度），回答钱学森之问的关键个人以为应该是，我们的社会在思想上仍然以教育是阶层赎买，而非智识探索；以人是手段，而非目的；以实用主义为主导，而缺乏对思想精神与元思考的敬畏。在这样的思想风气下一切选拔机制都会被异化。

海森堡在物理学家自然观中提到过自己关于西方传统教育和科学教育的思考。当时海森堡就明确表示了Once the arrow has left the bow,..., and without the presence of a spiritual being with an aim it would never have been able even to start on its flight. In this regard we could do far worse than teach our youth not to rate spiritual values too low. 对科学精神的追求与信仰，对个人价值的追求与寻觅，是西方科学精神的核心。海森堡在书中的思考主体是在以自身案例来引发读者思考，西方传统教育的精神来源导向教育（历史、哲学、语言学等）与科学教育（实用主义导向）到底谁优谁劣，我们应当如何选择。海森堡没有在书中给出答案，实则我们今天也在面临这个问题。

固然，我们不能一味崇洋媚外，直接引入西方的思想。西方这样的思想容易引来个人中心主义，我们一贯的优良传统也是集体主义优先，这是我们的效率的来源。但是，在集体主义之外，个体也要有除混沌的本能和对规则的盲从以外的自我意义意识，意识到自己的价值与集体价值的关联与意识到社会契约的存在，这才是更高层次的更本质的集体主义，而非刻意抹杀个体差异。

然而，我们的社会思维方式很难改变，而且深刻的思想变革缺乏危机是难以实现的，且必将带来暂时的不稳定。于是，这个决策便也超出了我们的能力范围了。”

===

# 2026-07-06-03

刚刚又和几个CS界的聊完所以总结两句。

其实计算机科学到现在，可以说是数学历史上第一次，在物理世界与客观实在的投影。但也是因此带来了巨大的困扰：数学本质上不是自然科学更像是逻辑自洽的艺术，因而计算机科学长期与物理实在脱钩。这还是根本矛盾。

也是因此，为了完成我们将数学投影得到的狭义计算的任务，我们诞生了图灵论题，循环论证的定义了可计算与图灵机完备性；由此自然而然诞生了冯诺依曼架构与哈佛架构（我们现在的计算机一般L1是指令和数据分离属于哈佛架构，其它层是冯诺依曼架构为了成本与效率）；也是因此，本质上因为数学与物理世界的不合，我们开始堆砌复杂度，从永无止境的分层存储，到系统工程的无数圣经无不如此；再到今天讨论的关于C-ABI过于保守阻碍了“完美”函数语言的区域化内存管理，线性类型的小对象不断创建销毁开销等，其实都是抽象堆叠的结果，抵抗熵增。还有x86的臃肿，risc的膨胀，以及大量我们设计的基于离散代数的算法，其实本质上都是将物理实在用一层层抽象强行抽象出数学的样子。所以，有一句话是没错的，计算机科学在于抽象，抽象不能泄露。

虽然某种意义上也泄漏了，现在我们面临的成千上万的问题与瓶颈不想列举了。

或许到了最后，计算还是会回归到它的本真，对现实世界的模拟，以及对过程的模拟。而这个过程既包括数学过程离散的操作，也就是复刻我们人脑思维方式；也包括大自然的过程借助自然进行过程的模拟。

费曼其实这么想过，比如量子计算的最初概念，可惜一到了计算机科学界量子计算很快便被抽象出来变成了能进行概率幅的并行搜索或特定代数结构的映射的图灵机辅助。但其实我们一直没意识到，计算作为工具应该是为目的服务的，任何可以实现我们模拟目的的过程都可以是广义上的计算。

和密码学方向的研究人员以前聊的时候我就警告过，不要把量子计算就当作能跑Shor和Grover的机器，可能特定代数结构比如格基结构会很容易被某些非图灵计算解决。尽管他们依然只是一笑觉得我在开玩笑也就带过去了。不过威胁确实存在。

当然，一旦这样的范式转变发生，现在的计算机科学界要不变成经典情况下的研究人员，要不就变成数学家，反正在社会学上推进这样的转变还是会极其困难的。以及社会惯性也极大。

===

# 2026-07-06-04

答友人问：

可能今天发的略显“深度”了，不过本质上只是一些日常闲谈。

关于看这些问题的角度本身不要太在意，因为角度本身还有被看的角度；思维方式本身也需要被思考去审视，而逻辑本身的荒谬性与无限逻辑递归的无意义性也使得没必要去纠结这些，如果感受到了需要则再进行就行。

当然，也就是说这些表述与思考都只是冰山一角，视角和理解很多，如果非得递归逻辑理解那么很多地方都可以继续用逻辑去审视，但正如前言，逻辑递归很没意义。
